# Найдите сумму цифр трехзначного числа.
# Пример:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

number = int(input('Введите трехзначное число: '))
if  number < 100 or number > 999:
    print('Введено не трехзначное число!')
else:
    print(int(number % 1000 / 100) + int(number % 100 / 10) + int(number % 10))